pmo-dataset/variations/graphviz_with_ids/02.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Complete orientation"];
  "Task_2" [label="Conduct initial\nphone interviews"];
  "Task_3" [label="Conduct a virtual\ninterview"];
  "Task_4" [label="Begin onboarding\nprocess"];
  "Task_5" [label="Identify need for\nnew hire"];
  "Task_6" [label="Choose candidate"];
  "Task_7" [label="Collect resumes"];
  "Task_8" [label="Extend offer"];
  "Task_9" [label="Complete training"];
  "Task_10" [label="Complete paperwork"];
  "Task_11" [label="Invite candidates\nfor interviews"];
  "Task_12" [label="Post job description"];
  "Task_13" [label="Create job\ndescription"];
  "Task_14" [label="Screen resumes"];
  "Task_15" [label="Negotiate salary"];
  "Task_16" [label="Conduct an in-person\ninterview"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "Task_12" -> "Task_7";
  "Task_6" -> "Task_8";
  "Task_15" -> "ExclusiveGateway_3";
  "Task_14" -> "Task_2";
  "Task_2" -> "Task_11";
  "ExclusiveGateway_2" -> "Task_6";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Task_1";
  "Task_1" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Task_10";
  "ExclusiveGateway_1" -> "Task_3";
  "Task_8" -> "ExclusiveGateway_6";
  "ParallelGateway_2" -> "EndNoneEvent_1";
  "ExclusiveGateway_1" -> "Task_16";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";
  "Task_16" -> "ExclusiveGateway_2";
  "Task_3" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Task_9";
  "Task_7" -> "Task_14";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Task_9" -> "ParallelGateway_2";
  "Task_13" -> "Task_12";
  "Task_11" -> "ExclusiveGateway_1";
  "Task_10" -> "ParallelGateway_2";
  "ExclusiveGateway_4" -> "Task_15";
  "ExclusiveGateway_5" -> "Task_4";
  "ExclusiveGateway_3" -> "ExclusiveGateway_5";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "Task_5" -> "Task_13";
  "StartNoneEvent_1" -> "Task_5";
  "Task_4" -> "ParallelGateway_1";
}
